## Plans :thumbsup:
## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # aws_s3_bucket.terrateam_bucket_031 will be destroyed
  # (because aws_s3_bucket.terrateam_bucket_031 is not in configuration)
-   resource "aws_s3_bucket" "terrateam_bucket_031" {
-       acl                         = "private" -> null
-       arn                         = "arn:aws:s3:::s03-tf-bucket" -> null
-       bucket                      = "s03-tf-bucket" -> null
-       bucket_domain_name          = "s03-tf-bucket.s3.amazonaws.com" -> null
-       bucket_regional_domain_name = "s03-tf-bucket.s3.us-east-1.amazonaws.com" -> null
-       force_destroy               = false -> null
-       hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
-       id                          = "s03-tf-bucket" -> null
-       object_lock_enabled         = false -> null
-       region                      = "us-east-1" -> null
-       request_payer               = "BucketOwner" -> null
-       tags                        = {} -> null
-       tags_all                    = {} -> null

-       grant {
-           id          = "d5240b81f2e64d47cdc27d87e497449c25e16939f453edb261de3c81f42e3d7f" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
        }

-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm = "AES256" -> null
                }
            }
        }

-       versioning {
-           enabled    = false -> null
-           mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.terrateam_bucket_03_02 will be created
+   resource "aws_s3_bucket" "terrateam_bucket_03_02" {
+       acceleration_status         = (known after apply)
+       acl                         = "private"
+       arn                         = (known after apply)
+       bucket                      = "s03-tf-bucket"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```


</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
